In [1]:
import pandas as pd
import numpy as np

In [5]:
data = pd.Series([1, 3, 5, 7, 9])

print(data.dtypes)
print('--------')
data = data.astype('float')
print(data.dtypes)

int64
--------
float64

# Q. DataFrame 생성하기
- 파이썬 2차원 리스트가 주어질 때

In [6]:
transaction = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-03', 700, 'confirmed'],
    ['2017-01-10', 200, 'canceled'],
]

In [7]:
tran = pd.DataFrame(transaction)
tran

            0    1          2
0  2017-01-01  500  confirmed
1  2017-01-03  700  confirmed
2  2017-01-10  200   canceled

# Q. 컬럼지정 안됐을 때 컬럼 추가하기

In [8]:
pd.DataFrame(transaction, columns = [0,'price','state'])

            0  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

# Q. 리스트안에 딕셔너리를 활용해서 데이터프레임 생성

In [9]:

# 위와 비슷하지만, 이번에는 list 안에 dictionary를 넣습니다.
transaction = [
    {'date': '2017-01-01', 'price': 500, 'state': 'confirmed'},
    {'date': '2017-01-03', 'price': 700, 'state': 'confirmed'},
    {'date': '2017-01-10', 'price': 200, 'state': 'canceled'},
]

pd.DataFrame(transaction)

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

# Q. 리스트 활용하여 데이터 프레임 만들고, 인덱스 기능으로 row에 이름 추가

In [10]:
transaction = [
    {'date': '2017-01-01', 'price': 500, 'state': 'confirmed'},
    {'date': '2017-01-03', 'price': 700, 'state': 'confirmed'},
    {'date': '2017-01-05', 'price': 800, 'state': 'confirmed'},
    {'date': '2017-01-07', 'price': 500, 'state': 'canceled'},
    {'date': '2017-01-09', 'price': 700, 'state': 'confirmed'},
    {'date': '2017-01-10', 'price': 200, 'state': 'canceled'},    
]


transaction = pd.DataFrame(transaction, index = ['Kang','Kim','Choi',"Park",'Lee',"Yoon"])
transaction

            date  price      state
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-05    800  confirmed
Park  2017-01-07    500   canceled
Lee   2017-01-09    700  confirmed
Yoon  2017-01-10    200   canceled

# Q. 데이터프레임의 인덱스 호출

In [11]:
transaction.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon'], dtype='object')

# Q. 데이터프레임의 컬럼 호출

In [12]:
transaction.columns

Index(['date', 'price', 'state'], dtype='object')

# Q. 데이터프레임의 통계 호출

In [13]:
transaction.describe()

            price
count    6.000000
mean   566.666667
std    216.024690
min    200.000000
25%    500.000000
50%    600.000000
75%    700.000000
max    800.000000

# Q. 데이터프레임 컬럼 이름 수정

In [14]:
transaction.columns = ['date','amount','result']
transaction

            date  amount     result
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-05     800  confirmed
Park  2017-01-07     500   canceled
Lee   2017-01-09     700  confirmed
Yoon  2017-01-10     200   canceled

# Q. index기준으로 정렬/ 반대로 정렬 구현

In [15]:
transaction.sort_index(ascending = False)

            date  amount     result
Yoon  2017-01-10     200   canceled
Park  2017-01-07     500   canceled
Lee   2017-01-09     700  confirmed
Kim   2017-01-03     700  confirmed
Kang  2017-01-01     500  confirmed
Choi  2017-01-05     800  confirmed

In [16]:
transaction.sort_values(by= 'amount',ascending = False)

            date  amount     result
Choi  2017-01-05     800  confirmed
Kim   2017-01-03     700  confirmed
Lee   2017-01-09     700  confirmed
Kang  2017-01-01     500  confirmed
Park  2017-01-07     500   canceled
Yoon  2017-01-10     200   canceled

# Q. 컬럼 기준으로 정렬

# Q. 특정 컬럼 기준으로 정렬

In [17]:
transaction.sort_values(by = 'date', ascending = True)

            date  amount     result
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-05     800  confirmed
Park  2017-01-07     500   canceled
Lee   2017-01-09     700  confirmed
Yoon  2017-01-10     200   canceled

# Q. 컬럼의 특정 데이터가 몇개 있는지 파악

In [18]:
transaction['result'].value_counts()

confirmed    4
canceled     2
Name: result, dtype: int64

# Q. 새로운 컬럼 생성

In [19]:
transaction['amount-diff'] = transaction['amount'].diff()
transaction

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Park  2017-01-07     500   canceled       -300.0
Lee   2017-01-09     700  confirmed        200.0
Yoon  2017-01-10     200   canceled       -500.0

In [20]:
transaction['date']

Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-05
Park    2017-01-07
Lee     2017-01-09
Yoon    2017-01-10
Name: date, dtype: object

In [21]:
transaction[['date','amount']]

            date  amount
Kang  2017-01-01     500
Kim   2017-01-03     700
Choi  2017-01-05     800
Park  2017-01-07     500
Lee   2017-01-09     700
Yoon  2017-01-10     200

# Q. 자신이 원하는 컬럼만 선택하여 호출

In [22]:
columnsss = ['date','amount']
transaction[columnsss]

            date  amount
Kang  2017-01-01     500
Kim   2017-01-03     700
Choi  2017-01-05     800
Park  2017-01-07     500
Lee   2017-01-09     700
Yoon  2017-01-10     200

# Q. 특정 인덱스 선택하여 호출

In [23]:
transaction.loc[['Kang','Kim','Lee']]

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Lee   2017-01-09     700  confirmed        200.0

In [24]:
row = ["Kim",'Lee','Park']
transaction.loc[row]

            date  amount     result  amount-diff
Kim   2017-01-03     700  confirmed        200.0
Lee   2017-01-09     700  confirmed        200.0
Park  2017-01-07     500   canceled       -300.0

In [25]:
transaction.loc['Kang':'Park']

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Park  2017-01-07     500   canceled       -300.0

# Q. Kang,Kim의 date를 추출

In [26]:
transaction.loc[['Kang','Kim'],'date']

Kang    2017-01-01
Kim     2017-01-03
Name: date, dtype: object

# Q. Kang의 date, result를 추출

In [27]:
transaction.loc['Kang',['date','result']]

date      2017-01-01
result     confirmed
Name: Kang, dtype: object

In [28]:
transaction.iloc[[0,3],[1,3]]

      amount  amount-diff
Kang     500          NaN
Park     500       -300.0

# Q. date가 2017-01-01인 series추출

In [29]:
transaction[transaction['date'] == '2017-01-01']

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN

# Q. result가 confirmed인 series추출

In [30]:
transaction[transaction['result']=='confirmed']

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Lee   2017-01-09     700  confirmed        200.0

# Q. amount가 700이하인 series추출

In [31]:
transaction[transaction['amount']<700]

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Park  2017-01-07     500   canceled       -300.0
Yoon  2017-01-10     200   canceled       -500.0

# Q. 특정 칼럼에서 결측값이 없는 series만 추출 / 반대의 경우도

In [32]:
transaction[transaction['amount-diff'].notnull()]

            date  amount     result  amount-diff
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Park  2017-01-07     500   canceled       -300.0
Lee   2017-01-09     700  confirmed        200.0
Yoon  2017-01-10     200   canceled       -500.0

In [33]:
transaction[~transaction['amount-diff'].notnull()]

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN

# Q. result는 confirmed이고, amount는 700 미만인 series 추출

In [34]:
transaction[(transaction['result']=='confirmed') & (transaction['amount']<700)]

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN

In [35]:
confirmed = transaction['result'] =='confirmed'
high_paid = transaction['amount'] >= 500

transaction[confirmed&high_paid]

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Lee   2017-01-09     700  confirmed        200.0

In [36]:
# 1-1
transaction[transaction['result']=='confirmed']

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Lee   2017-01-09     700  confirmed        200.0

In [37]:
# 1-2
confirmed = transaction['result'] == 'confirmed'
transaction[confirmed]

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Lee   2017-01-09     700  confirmed        200.0

In [38]:
# 2
transaction_confirmed = transaction[transaction['result'] == 'confirmed']
transaction_confirmed
#1과 2의 차이가 무엇

            date  amount     result  amount-diff
Kang  2017-01-01     500  confirmed          NaN
Kim   2017-01-03     700  confirmed        200.0
Choi  2017-01-05     800  confirmed        100.0
Lee   2017-01-09     700  confirmed        200.0

# apply 메소드와 lambda
# Q. amount가 600 이상인 조건일 때, VIP 컬럼 새로 만들어 True할당 (apply사용)

In [39]:
def isvip(amount):
    return amount>=600

transaction["VIP"] = transaction['amount'].apply(isvip)
transaction

            date  amount     result  amount-diff    VIP
Kang  2017-01-01     500  confirmed          NaN  False
Kim   2017-01-03     700  confirmed        200.0   True
Choi  2017-01-05     800  confirmed        100.0   True
Park  2017-01-07     500   canceled       -300.0  False
Lee   2017-01-09     700  confirmed        200.0   True
Yoon  2017-01-10     200   canceled       -500.0  False

## apply 함수와 동일합니다. 이와 같은 방식을 람다(lambda), 내지는 익명 함수라고 부릅니다.
## point: 함수를 굳이 만들 필요가 없을 정도로 코드가 간결하다면, 굳이 함수를 만들지 않고 lambda를 사용하는 것 만으로 충분합니다.

In [40]:
transaction['VIP'] = transaction['amount'].apply(lambda amount: amount>=500)
transaction

            date  amount     result  amount-diff    VIP
Kang  2017-01-01     500  confirmed          NaN   True
Kim   2017-01-03     700  confirmed        200.0   True
Choi  2017-01-05     800  confirmed        100.0   True
Park  2017-01-07     500   canceled       -300.0   True
Lee   2017-01-09     700  confirmed        200.0   True
Yoon  2017-01-10     200   canceled       -500.0  False

In [41]:
transaction.loc['Kang'].apply(lambda x: x == 500)

date           False
amount          True
result         False
amount-diff    False
VIP            False
Name: Kang, dtype: bool

In [42]:
def is_vip(row):
    amount = row["amount"]
    result = row["result"]

    return result == "confirmed" and amount >= 500

# 복수의 컬럼을 동시에 쓰고 싶다면 Series가 아닌 DataFrame에다가 apply를 할 수 있습니다.
# 여기서 axis를 1로 지정해주면 row가 하나씩 들어가고, axis를 0으로 지정해주면 column이 하나씩 들어갑니다.
transaction["VIP"] = transaction.apply(is_vip, axis=1)
transaction

            date  amount     result  amount-diff    VIP
Kang  2017-01-01     500  confirmed          NaN   True
Kim   2017-01-03     700  confirmed        200.0   True
Choi  2017-01-05     800  confirmed        100.0   True
Park  2017-01-07     500   canceled       -300.0  False
Lee   2017-01-09     700  confirmed        200.0   True
Yoon  2017-01-10     200   canceled       -500.0  False

# Q. 데이터 프레임에서 특정 row삭제

In [43]:
transaction = transaction.drop('Kang', axis = 0, inplace = False)
transaction

            date  amount     result  amount-diff    VIP
Kim   2017-01-03     700  confirmed        200.0   True
Choi  2017-01-05     800  confirmed        100.0   True
Park  2017-01-07     500   canceled       -300.0  False
Lee   2017-01-09     700  confirmed        200.0   True
Yoon  2017-01-10     200   canceled       -500.0  False

# Q. 데이터 프레임에서 특정 column삭제

In [44]:
transaction.drop(['amount','VIP'],axis = 1) # inplace = True 넣지 않으면 재호출시 원복

            date     result  amount-diff
Kim   2017-01-03  confirmed        200.0
Choi  2017-01-05  confirmed        100.0
Park  2017-01-07   canceled       -300.0
Lee   2017-01-09  confirmed        200.0
Yoon  2017-01-10   canceled       -500.0

In [45]:
transaction

            date  amount     result  amount-diff    VIP
Kim   2017-01-03     700  confirmed        200.0   True
Choi  2017-01-05     800  confirmed        100.0   True
Park  2017-01-07     500   canceled       -300.0  False
Lee   2017-01-09     700  confirmed        200.0   True
Yoon  2017-01-10     200   canceled       -500.0  False

# Q. 컬럼 추가/수정하기
- 1. 한 컬럼에 같은 값 넣기
- 2. 한 컬럼에 다른 값 넣기

In [46]:
transaction['card-holder'] = 'IBK'
transaction

            date  amount     result  amount-diff    VIP card-holder
Kim   2017-01-03     700  confirmed        200.0   True         IBK
Choi  2017-01-05     800  confirmed        100.0   True         IBK
Park  2017-01-07     500   canceled       -300.0  False         IBK
Lee   2017-01-09     700  confirmed        200.0   True         IBK
Yoon  2017-01-10     200   canceled       -500.0  False         IBK

In [47]:
transaction['order'] = [1,2,3,4,5]
transaction

            date  amount     result  amount-diff    VIP card-holder  order
Kim   2017-01-03     700  confirmed        200.0   True         IBK      1
Choi  2017-01-05     800  confirmed        100.0   True         IBK      2
Park  2017-01-07     500   canceled       -300.0  False         IBK      3
Lee   2017-01-09     700  confirmed        200.0   True         IBK      4
Yoon  2017-01-10     200   canceled       -500.0  False         IBK      5

# Q. amount가 500 이상인 row에 vip 컬럼에 True 할당, 그렇지 않을 땐 false할당

In [48]:
transaction.loc[transaction['amount']>=500, 'VIP'] = True
transaction.loc[transaction['amount']<500, 'VIP'] = False
transaction

            date  amount     result  amount-diff    VIP card-holder  order
Kim   2017-01-03     700  confirmed        200.0   True         IBK      1
Choi  2017-01-05     800  confirmed        100.0   True         IBK      2
Park  2017-01-07     500   canceled       -300.0   True         IBK      3
Lee   2017-01-09     700  confirmed        200.0   True         IBK      4
Yoon  2017-01-10     200   canceled       -500.0  False         IBK      5

# Q. 이중 조건 할당, 위 조건에서 result가 confirm일 때 VIP에 True할당.
# Q.위 조건중 하나라도 만족 못할 시 false할당

In [49]:

transaction.drop(['amount-diff'],axis = 1, inplace = True)
transaction.loc[(transaction['amount']>= 500) & (transaction['result']=='confirmed'), 'VIP']= True
transaction.loc[(transaction['amount']< 500) | (transaction['result']!='confirmed'), 'VIP']= False
transaction

            date  amount     result    VIP card-holder  order
Kim   2017-01-03     700  confirmed   True         IBK      1
Choi  2017-01-05     800  confirmed   True         IBK      2
Park  2017-01-07     500   canceled  False         IBK      3
Lee   2017-01-09     700  confirmed   True         IBK      4
Yoon  2017-01-10     200   canceled  False         IBK      5